dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
#include <stdint.h>
#include <stdarg.h>
#include <stdbool.h>
#include "inc/hw_i2c.h"
#include "inc/hw_memmap.h"
#include "inc/hw_types.h"
#include "inc/hw_gpio.h"
#include "driverlib/i2c.h"
#include "driverlib/sysctl.h"
#include "driverlib/gpio.h"
#include "driverlib/pin_map.h"
#include "i2c.h"

#include "py/runtime.h"
#include "py/obj.h"
#include "py/builtin.h"
#include "driverlib/rom.h"
#include "driverlib/rom_map.h"
#include "py/mpprint.h"

void i2c_init0() {}

STATIC int i2c_find(mp_obj_t id)
{
    if (MP_OBJ_IS_STR(id))
    {
        // given a string id
        const char *port = mp_obj_str_get_str(id);
        if (0)
        {
#ifdef MICROPY_HW_I2C0_NAME
        }
        else if (strcmp(port, MICROPY_HW_I2C0_NAME) == 0)
        {
            return I2C_0;
#endif
#ifdef MICROPY_HW_I2C1_NAME
        }
        else if (strcmp(port, MICROPY_HW_I2C1_NAME) == 0)
        {
            return I2C_1;
#endif
#ifdef MICROPY_HW_I2C2_NAME
        }
        else if (strcmp(port, MICROPY_HW_I2C2_NAME) == 0)
        {
            return I2C_2;
#endif
#ifdef MICROPY_HW_I2C3_NAME
        }
        else if (strcmp(port, MICROPY_HW_I2C3_NAME) == 0)
        {
            return I2C_3;
#endif
        }
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
                                                "I2C(%s) doesn't exist", port));
    }
    else
    {
        // given an integer id
        int i2c_id = mp_obj_get_int(id);
        if (i2c_id >= 0 && i2c_id <= MP_ARRAY_SIZE(MP_STATE_PORT(machine_spi_obj_all)))
        {
            return i2c_id;
        }
        nlr_raise(mp_obj_new_exception_msg_varg(&mp_type_ValueError,
                                                "I2C(%d) doesn't exist", i2c_id));
    }
}

// INITIALIZATION
//initialize I2C module 0
//Slightly modified version of TI's example code

void InitI2C0(machine_hard_i2c_obj_t *self)
{
    const pin_obj_t *pins[2] = {NULL, NULL};

    if (0)
    {
#if defined(MICROPY_HW_I2C0_SCL)
    }
    else if (self->i2c_id == I2C_0)
    {
        self->i2c_base = I2C0_BASE;
        self->periph = SYSCTL_PERIPH_I2C0;
        self->master_regs = (periph_i2c_master_t *)I2C0_BASE;
        self->slave_regs = (periph_i2c_slave_t *)(I2C0_BASE + 0x800);
        self->status_control = (periph_i2c_stctl_t *)(I2C0_BASE + 0xFC0);
        self->irqn = INT_I2C0;
        pins[0] = MICROPY_HW_I2C0_SCL;
#if defined(MICROPY_HW_I2C0_SDA)
        pins[1] = MICROPY_HW_I2C0_SDA;
#endif
#endif
#if defined(MICROPY_HW_I2C1_SCL)
    }
    else if (self->i2c_id == I2C_1)
    {
        self->i2c_base = I2C1_BASE;
        self->periph = SYSCTL_PERIPH_I2C1;
        self->master_regs = (periph_i2c_master_t *)I2C1_BASE;
        self->slave_regs = (periph_i2c_slave_t *)(I2C1_BASE + 0x800);
        self->status_control = (periph_i2c_stctl_t *)(I2C1_BASE + 0xFC0);
        self->irqn = INT_I2C1;
        pins[0] = MICROPY_HW_I2C1_SCL;
#if defined(MICROPY_HW_I2C1_SDA)
        pins[1] = MICROPY_HW_I2C1_SDA;
#endif
#endif
#if defined(MICROPY_HW_I2C2_SCL)
    }
    else if (self->i2c_id == I2C_2)
    {
        self->i2c_base = I2C2_BASE;
        self->periph = SYSCTL_PERIPH_I2C2;
        self->master_regs = (periph_i2c_master_t *)I2C2_BASE;
        self->slave_regs = (periph_i2c_slave_t *)(I2C2_BASE + 0x800);
        self->status_control = (periph_i2c_stctl_t *)(I2C2_BASE + 0xFC0);
        self->irqn = INT_I2C2;
        pins[0] = MICROPY_HW_I2C2_SCL;
#if defined(MICROPY_HW_I2C2_SDA)
        pins[1] = MICROPY_HW_I2C2_SDA;
#endif
#endif
#if defined(MICROPY_HW_I2C3_SCL)
    }
    else if (self->i2c_id == I2C_3)
    {
        self->i2c_base = I2C3_BASE;
        self->periph = SYSCTL_PERIPH_I2C3;
        self->master_regs = (periph_i2c_master_t *)I2C3_BASE;
        self->slave_regs = (periph_i2c_slave_t *)(I2C3_BASE + 0x800);
        self->status_control = (periph_i2c_stctl_t *)(I2C3_BASE + 0xFC0);
        self->irqn = INT_I2C3;
        pins[0] = MICROPY_HW_I2C3_SCL;
#if defined(MICROPY_HW_I2C3_SDA)
        pins[1] = MICROPY_HW_I2C3_SDA;
#endif
#endif
    }
    else
    {
        // I2C does not exist for this board (shouldn't get here, should be checked by caller)
        return;
    }

    //disable I2C module 0
    SysCtlPeripheralDisable(self->periph);

    //reset module
    SysCtlPeripheralReset(self->periph);

    //enable I2C module 0
    SysCtlPeripheralEnable(self->periph);

    // config of Alternative Function for Pins
    mp_hal_pin_config_alt(pins[0], PIN_FN_I2C, self->i2c_id);
    mp_hal_pin_config_alt(pins[1], PIN_FN_I2C, self->i2c_id);

    // Enable and initialize the I2C0 master module.  Use the system clock for
    // the I2C0 module.  The last parameter sets the I2C data transfer rate.
    // If false the data rate is set to 100kbps and if true the data rate will
    // be set to 400kbps.
    if (self->mode == I2C_MODE_MASTER)
    {
        // Init Master Module for given I2C Port with normal Clock Frequency (100kHz)
        I2CMasterInitExpClk(self->i2c_base, SysCtlClockGet(), false); // 0x40020000 = I2C0_BASE
    }
    else if (self->mode == I2C_MODE_SLAVE)
    {
        // Init Slave Module for given I2C Port and Slave Address
        I2CSlaveInit(self->i2c_base, (uint8_t)self->i2c_id);
    }

    //clear I2C FIFOs
    HWREG(self->i2c_base + I2C_O_FIFOCTL) = 80008000;
}

// STATIC void i2c_start_condition(mp_obj_t *self_in, bool read_write)
// {
//     machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

//     I2CMasterSlaveAddrSet(self->i2c_base, self->i2c_base + I2C_O_MSA, read_write);
// }

//sends data and, if requested, a memory location (register) via I2C
void i2c_master_tx(mp_obj_t *self_in, uint8_t device_address, bool address_flag, uint8_t mem_loc, bool mem_loc_flag, uint8_t *device_data, size_t size)
{
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;
    uint32_t err_code;

    mp_printf(MP_PYTHON_PRINTER, "reached c function\nsize of data buffer: %d\n", size);

    // specify that we want to communicate to device address with an intended write to bus
    // set bitrate to 100 kHz
    I2CMasterSlaveAddrSet(self->i2c_base, device_address, false);

    // make sure no other Master is currently using the BUS
    // while(I2CMasterBusBusy(self->i2c_base));

    err_code = I2CMasterErr(self->i2c_base);
    mp_printf(MP_PYTHON_PRINTER, "error code %d\n", err_code);

