dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
            // get data from initialized I2C port
            *device_data = (uint8_t)I2CMasterDataGet(self->i2c_base);

            // end transfer
            return;
        }
        else
        {
            if (mem_loc_flag && address_flag)
            {
                // mp_printf(MP_PYTHON_PRINTER, "register address send reached\nsize of data buffer: %d\n", size);
                // // memory location to be written to
                // I2CMasterDataPut(self->i2c_base, mem_loc);

                // // send start condition, address byte and bit for write direction to slave device
                // I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_START);

                // // wait for Master Control Unit to finish transaction
                // while (I2CMasterBusy(self->i2c_base))
                // {}

                // // check for errors
                // if (I2CMasterErr(self->i2c_base))
                // {
                //     // if error occured, cancel write routine
                //     I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

                //     // return error code
                //     nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data transfer failed - memory location unkown\n"));
                // }
            }
            else
            {
                if (address_flag)
                {
                    mp_printf(MP_PYTHON_PRINTER, "read function data buffer reached\nsize of data buffer: %d\n", size);

                    // send data to the slave
                    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_START);

                    // wait for Master Control Unit to finish transaction
                    while (I2CMasterBusy(self->i2c_base))
                    {
                    }

                    // check for errors
                    if (I2CMasterErr(self->i2c_base))
                    {
                        // if error occured, cancel write routine
                        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

                        // return error code
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data transfer failed\n"));
                    }

                    // get received byte
                    *device_data++ = (uint8_t)I2CMasterDataGet(self->i2c_base);
                }
            }

            if (address_flag)
            {
                // send payload
                for (size_t i = 1; i < size; i++)
                {
                    mp_printf(MP_PYTHON_PRINTER, "rest of buffer read reached\nsize of data buffer: %d\n", size);
                    // last byte?
                    if (i == (size - 1))
                    {

                        // send desired memory location to the slave (can be anything)
                        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_FINISH);

                        // wait for Master Control Unit to finish transaction
                        while (I2CMasterBusy(self->i2c_base))
                        {
                        }

                        // check for errors
                        if (I2CMasterErr(self->i2c_base))
                        {
                            // if error occured, cancel write routine
                            I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

                            // return error code
                            nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data read failed\n"));
                        }

                        *device_data = (uint8_t)I2CMasterDataGet(self->i2c_base);
                        // transfer finished
                        return;
                    }

                    // send data to the slave
                    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_CONT);

                    // wait for Master Control Unit to finish transaction
                    while (I2CMasterBusy(self->i2c_base))
                    {
                    }

                    // check for errors
                    if (I2CMasterErr(self->i2c_base))
                    {
                        // if error occured, cancel write routine
                        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

                        // return error code
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data read failed\n"));
                    }

                    // get received byte from initialized I2C port
                    *device_data++ = (uint8_t)I2CMasterDataGet(self->i2c_base);
                }
            }
            else
            {
                for (size_t i = 0; i < size; i++)
                {
                    // send data to the slave
                    I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_CONT);

                    // wait for Master Control Unit to finish transaction
                    while (I2CMasterBusy(self->i2c_base))
                    {
                    }

                    // check for errors
                    if (I2CMasterErr(self->i2c_base))
                    {
                        // if error occured, cancel write routine
                        I2CMasterControl(self->i2c_base, I2C_MASTER_CMD_BURST_RECEIVE_ERROR_STOP);

                        // return error code
                        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "data read failed\n"));
                    }

                    // get received byte from initialized I2C port
                    *device_data++ = (uint8_t)I2CMasterDataGet(self->i2c_base);
                }
            }
        }
    }
}


void deinitI2C0(const mp_obj_t *self_in)
{
    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;
    //I2CDisable(self->i2c_base);
    SysCtlPeripheralDisable(self->periph);
}

/* --------- Binding for Micropython ------------ */
/* ---------------------------------------------- */

STATIC void machine_hard_i2c_print(const mp_print_t *print, mp_obj_t self_in, mp_print_kind_t kind)
{
    machine_hard_i2c_obj_t *i2c = (machine_hard_i2c_obj_t *)self_in;
    ;

    mp_printf(print, "I2C(%u", i2c->i2c_id);

    if (i2c->mode == I2C_MODE_MASTER)
    {
        mp_printf(print, ", I2C.MASTER)");
    }
    else if (i2c->mode == I2C_MODE_SLAVE)
    {
        mp_printf(print, ", I2C.SLAVE)");
    }
}

