dannyvondenhoerbergen/micropython/ports/tm4c123/mods/i2c.c
/*
	Wrapping Function
*/
STATIC mp_obj_t machine_hard_i2c_init_helper(mp_obj_t *self_in, size_t n_args, const mp_obj_t *pos_args, mp_map_t *kw_args)
{
    enum
    {
        ARG_id,
        ARG_mode
    };
    static const mp_arg_t allowed_args[] = {
        {MP_QSTR_id, MP_ARG_REQUIRED | MP_ARG_INT, {.u_int = I2C_0}},            // default: I2C0
        {MP_QSTR_mode, MP_ARG_KW_ONLY | MP_ARG_INT, {.u_int = I2C_MODE_MASTER}}, // default: Master
    };

    mp_arg_val_t args[MP_ARRAY_SIZE(allowed_args)];
    mp_arg_parse_all(n_args, pos_args, kw_args, MP_ARRAY_SIZE(allowed_args), allowed_args, args);

    machine_hard_i2c_obj_t *self = (machine_hard_i2c_obj_t *)self_in;

    // set the I2C id value
    if (args[ARG_id].u_int > 3)
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Available I2C-Ports: 0 - 3"));
    }
    self->i2c_id = args[ARG_id].u_int;

    // set the I2C mode
    if (args[ARG_mode].u_int > I2C_MODE_SLAVE)
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Mode accepts only MASTER or SLAVE"));
    }
    self->mode = (uint16_t)(args[ARG_mode].u_int & 0xFFFF);

    // calling I2C-Init function
    InitI2C0(self);

    return mp_const_none;
}

STATIC void machine_hard_i2c_write(mp_obj_base_t *self_in, uint16_t dev_addr, bool address_flag, uint16_t reg_addr, bool mem_loc_flag, uint8_t *i2c_data, size_t size)
{
    i2c_master_tx((mp_obj_t *)self_in, dev_addr, address_flag, reg_addr, mem_loc_flag, i2c_data, size);
}

/* Write Function */

STATIC mp_obj_t mp_machine_hard_i2c_write_into(size_t n_args, const mp_obj_t *args)
{

    if (n_args == 4)
    {
        // casting Micropython data types to c data types
        uint16_t int_dev_address = mp_obj_get_int(args[1]);
        mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);
        uint16_t int_reg_address = mp_obj_get_int(args[2]);
        mp_printf(MP_PYTHON_PRINTER, "register address: %d\n", int_reg_address);
        mp_buffer_info_t i2c_data;
        mp_get_buffer_raise(args[3], &i2c_data, MP_BUFFER_READ);
        mp_printf(MP_PYTHON_PRINTER, "1. byte of buffer: %d\n", *(uint8_t *)i2c_data.buf);

        // calling I2C-Send Function
        machine_hard_i2c_write(args[0], int_dev_address, true, int_reg_address, true, (uint8_t *)i2c_data.buf, i2c_data.len);
    }
    else
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Wrong number of arguments\n"));
    }

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_write_into_obj, 4, 4, mp_machine_hard_i2c_write_into);

STATIC mp_obj_t mp_machine_hard_i2c_write(size_t n_args, const mp_obj_t *args)
{
    if (n_args == 3)
    {
        // casting Micropython data types to c data types
        uint8_t int_dev_address = mp_obj_get_int(args[1]);
        mp_printf(MP_PYTHON_PRINTER, "device address: %d\n", int_dev_address);
        mp_buffer_info_t i2c_data;
        mp_get_buffer_raise(args[2], &i2c_data, MP_BUFFER_READ);
        mp_printf(MP_PYTHON_PRINTER, "1. byte of buffer: %d\n", *(uint8_t *)i2c_data.buf);

        // calling I2C-Send Function
        machine_hard_i2c_write(args[0], int_dev_address, true, 0, false, (uint8_t *)i2c_data.buf, i2c_data.len);
    }
    else
    {
        nlr_raise(mp_obj_new_exception_msg(&mp_type_ValueError, "Wrong number of arguments\n"));
    }
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_VAR_BETWEEN(mp_machine_hard_i2c_write_obj, 3, 3, mp_machine_hard_i2c_write);

STATIC void machine_hard_i2c_read(mp_obj_base_t *self_in, uint8_t device_address, bool address_flag, uint16_t reg_address, bool reg_flag, uint8_t *read_buffer, bool buffer_flag, size_t nbytes)
{
    i2c_master_rx((mp_obj_t *)self_in, device_address, address_flag, reg_address, reg_flag, read_buffer, buffer_flag, nbytes);
}

STATIC mp_obj_t mp_machine_hard_i2c_readinto(mp_obj_t self, mp_obj_t buff)
{
    mp_buffer_info_t i2c_read_buff;
    mp_get_buffer_raise(buff, &i2c_read_buff, MP_BUFFER_WRITE);
    machine_hard_i2c_read(self, 0, false, 0, false, (uint8_t *)i2c_read_buff.buf, true, i2c_read_buff.len);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_2(mp_machine_hard_i2c_readinto_obj, mp_machine_hard_i2c_readinto);

STATIC mp_obj_t mp_machine_hard_i2c_readfrom(mp_obj_t self, mp_obj_t device_address, mp_obj_t size)
{
    uint8_t dev_address = mp_obj_get_int(device_address);
    size_t nbytes = (size_t)mp_obj_get_int(size);

    // hier weiter machen! fkt. muss byte zurück geben!
   
    machine_hard_i2c_read(self, dev_address, true, 0, false, (uint8_t *)i2c_read_buff.buf, true, i2c_read_buff.len);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(mp_machine_hard_i2c_readfrom_into_obj, mp_machine_hard_i2c_readfrom_into);

STATIC mp_obj_t mp_machine_hard_i2c_readfrom_into(mp_obj_t self, mp_obj_t device_address, mp_obj_t buff)
{
    uint8_t dev_address = mp_obj_get_int(device_address);
    mp_buffer_info_t i2c_read_buff;
    mp_get_buffer_raise(buff, &i2c_read_buff, MP_BUFFER_WRITE);
    machine_hard_i2c_read(self, dev_address, true, 0, false, (uint8_t *)i2c_read_buff.buf, true, i2c_read_buff.len);
    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_3(mp_machine_hard_i2c_readfrom_into_obj, mp_machine_hard_i2c_readfrom_into);

/* DeInit Function */

STATIC mp_obj_t i2c_deinit(mp_obj_t self_in)
{
    deinitI2C0(&self_in);

    return mp_const_none;
}
STATIC MP_DEFINE_CONST_FUN_OBJ_1(i2c_deinit_obj, i2c_deinit);

STATIC mp_obj_t machine_hard_i2c_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args)
{
    return machine_hard_i2c_init_helper(args[0], n_args - 1, args + 1, kw_args);
}
STATIC MP_DEFINE_CONST_FUN_OBJ_KW(machine_i2c_init_obj, 1, machine_hard_i2c_init);

/*
	Define uPy-Fuctions
*/

/*
	Table with all globals
*/
STATIC const mp_rom_map_elem_t machine_hard_i2c_locals_dict_table[] = {
    // methods
    {MP_OBJ_NEW_QSTR(MP_QSTR___name__), MP_OBJ_NEW_QSTR(MP_QSTR_i2c)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_init), MP_ROM_PTR(&machine_i2c_init_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_write), MP_ROM_PTR(&mp_machine_hard_i2c_write_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_write_into), MP_ROM_PTR(&mp_machine_hard_i2c_write_into_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_readinto), MP_ROM_PTR(&mp_machine_hard_i2c_readinto_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_readfrom_into), MP_ROM_PTR(&mp_machine_hard_i2c_readfrom_into_obj)},
    {MP_OBJ_NEW_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&i2c_deinit_obj)},

    // constants
    {MP_ROM_QSTR(MP_QSTR_MASTER), MP_ROM_INT(I2C_MODE_MASTER)},
    {MP_ROM_QSTR(MP_QSTR_SLAVE), MP_ROM_INT(I2C_MODE_SLAVE)},
};

